---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarReinforcementData
source: html/04f8cd5d-d4cc-b598-c408-5bd608224b01.htm
---
# Autodesk.Revit.DB.Structure.RebarReinforcementData

class containing the id and the end of rebar on which the coupler stays

## Syntax (C#)
```csharp
public class RebarReinforcementData : ReinforcementData
```